import { Component, Inject } from '@angular/core';
import { MatDialogRef, MAT_DIALOG_DATA} from '@angular/material/dialog';

export interface Story{
  id:number;
image:string;
title:string;
text:string
}
@Component({
  selector: 'app-InvestigationDialog',
  templateUrl: './InvestigationDialog.component.html',
  styleUrls: ['./InvestigationDialog.component.css']
})
export class InvestigationDialogComponent  {

  stories:Story[]=[
    {
      id:4,
      title:'אישום בהריגה בתאונת רכבי יוקרה',
      image:'../../assets/Picture7.png',
      text:" בתאריך 17.5.13 בסביבות השעה 16:00 התרחשה תאונת דרכים בכביש 40 סמוך לאוניברסיטת בר-אילן בין רכב BMW שחורה לבין רכב אספנות מסוג פורש שנת 1976. רכב  BMW נשרף כליל שניות לאחר ששני נוסעים יצאו ממנו ללא פגע.בדמו של נהג ה-BMW נמצאה רמת אלכוהול גבוהה מן המותר. ברכב נמצא בקבוק שתיה חריפה.רכב הפורש נעצר נעצר במרחק של כ- 4 מטרים מרכב BMW.שני הנוסעים נפגעו בצורה קשה מכוויות למרות שהרכב בחלקו החיצוני (כמעט) ללא סימני חום או פיח.לאחר הגשת כתב אישום כנגד נהג ה- BMW, הגישה ההגנה חוות דעת של מומחה מטעמה לפיה הדליקה בפורש נגרמה כתוצאה מאביזר לא תיקני בתוך הפורש, ושאין קשר בין הדליקה בפורש לבין התאונה. בחודש דצמבר, 7 חודשים לאחר האירוע, התבקשתי על ידי פרקליטות מחוז תל אביב לסייע בחקירת נסיבות האירוע. חקירת דליקת רכב היא חקירה קשה מאד. חקירת נסיבות דליקת רכב 7 חודשים לאחר האירוע, היא חקירה (כמעט) בלתי אפשרית. למרות הסיכוי הנמוך להבין את הנסיבות, פעלתי לסייע בתיק: הקמתי צוות חקירה, בחנתי את הרכב, קראתי ספרות והתייעצתי במומחים.על סמך כל אלה, ניסחתי חוות דעת לפיה הכוויות שנגרמו לנוסעים ברכב מסוג פורש, נגרמו משמן רותח שהותז לכיוונם בעקבות התאונה ולאחר פגיעה בצנרת מערכת קירור שמן של הרכב.בית המשפט בראשותה של כב השופטת אמסטרדם קיבלה את חוות הדעת ועל בסיסה הרשיע את נהג ה- BMW בהריגה.בשנת 2019 אישר בית המשפט העליון את פסק הדין. "
    },
    {
      id:3,
      title:'הצתת מרפאת שיניים בראש העין',
      image:'../../assets/Picture2.png',
      text:"לפי כתב האישום, ב-2 באוגוסט 2002, שפכו הנאשמים בנזין בחדרי המרפאה והציתו את המקום. כתוצאה, נגרם פיצוץ עז ולאחריו דליקה שגרמו לחבלות גופניות לבני המשפחה ולנאשמים וכן לנזק כבד למבנה של המרפאה ולבית השכנים. פציעתו של בעל המרפאה ואדם נוסף שהיה איתו, העלו את החשד לכך שהם היו אלה שהציתו את המרפאה .בחקירה משלימה של יחידת החקירות, נמצאו ממצאים נסיבתיים מחשידים נוספים.              לגרסתו של מומחה ההגנה, האירוע התרחש כתוצאה מתקלה בפיית אמגזית שעליה ניסו הנאשמים להכין קפה והיא גרמה לדליקה. הפיצוץ לטענתו, היה מאוחר לדליקה. לביסוס טענתו הכין סרט המציג תרחיש אפשרי לפרוץ האירוע.מומחה נוסף מטעם ההגנה, פרופ' לכימיה בעל שם, מרצה באוניברסיטת בן-גוריון וכן בשורת מכללות בישראל, מומחה ראשון במעלה בישראל בתחומי הדלק הרקטי ויועץ מערכת הבטחון בתחום זה אשר קבע כי מומחי התביעה התעלמו מן העובדה שהדליקה והפיצוץ התרחשו במעבדת שיניים שמטבע הדברים מכילה חומרים כימיים רבים והם אלה שבמהלך הדליקה, יצרו מופע דומה לבנזין, כפי שהתקבל בבדיקות המעבדה. "
    },
    {
      id:2,
      title:'הדליקה ביערות הכרמל',
      image:'../../assets/Picture8.png',
      text:" הדליקה המשפיעה ביותר של בישראל: הדליקה שפרצה ב- 2.12.2010 במבואות המערביים של עוספיה, גרמה למותם של 44 איש, הובילה להקמת מערך כבאות לאומי! האש התפשטה כ- 100 שעות ושרפה שטח של כ- 20,000 דונם.בחוות דעת צוות החקירה שהוקם על ידי, נקבע כי מניתוח הממצאים ניתן לקבוע בסבירות גבוהה מאד שמוקד הדליקה ממוקםם בנצ  205200/736350 ברדיוס של 25 מ.באיזור המתואר נמצאו שני מוקדי פעילות אדם הכוללים מעגל אבנים של מדורה ושרידי פחמים בשוחה מכוסים בעפר בנצ  205215/736345 , 205195/736362.להבנת נסיבות פרוץ הדליקה היתה חשיבות עליונה: בעבודת חקירה אותרו שני נערים שגרמו לדליקה ברשלנות. "
    },
    {
      id:1,
      title:'רצח בני משפחת אושרנקו',
      image:'../../assets/Picture6.png',
      text:" ביום שבת  17.10.09 בסביבות השעה 07:30 התקבלה קריאה במערך הכיבוי, ומיד לאחר מכן במשטרת ישראל, על דליקה בדירת מגורים בראשון לציון.צוותי הכיבוי והמשטרה שהגיעו למקום, נדהמו לראות ששה (6) בני משפחה, סבא וסבתא, זוג צעיר ושתי בנותיהם, דקורים למוות בצורה אכזרית וסימני חום ופיח קלים על הקירות. מפכל המשטרה דאז, רב ניצב דודי כהן, אמר לאחר ביקור בזירה: אני מתעסק בפשיעה כמעט 20 שנה. אני חושב שראינו בעבר מספר אירועים קשים מאד, אבל אירוע שכזה למיטב זכרוני לא התרחש ב-20 השנה האחרונות. הגעתי לזירה כחלק מצוותי המזפ, מתוך כוונה לאתר ממצא שיאפשר הבאה לדין של הרוצח האכזרי."
    }

  ]
  story:Story;
  constructor(
    public dialogRef: MatDialogRef<InvestigationDialogComponent>,
    @Inject(MAT_DIALOG_DATA) public data:any) {
    this.story= this.stories.find(x=>x.id==data);
    }

  onNoClick(): void {
    this.dialogRef.close();
  }

}
